// Ответ:
// Данная в задании переменная input после первой итерации декодировки представляет собой '.4-2.4-1.4-6.1-4.2-4.1-12.1-4.2-12.1-2.1-4.2-18.1-4.4-1.4-2.18-1.6-1.4-4.4-1.8-1.4-4.6-1.16-1.4-4.12-1.4-8.1-4.4-16.1-18.1-4.4-18.1-10.1-4.6-6.1-4.2-1.4-6.6-1.20-1.8-6.1-4.1-8.6-1.14', 
// после второй 'i love puzzles'. 


const decode = input => input
  .replace(/(\.|-)\d+/g, x => `${x.slice(1) == '1' ? '.' : (x.slice(1) - 2) / 2}`)
  .split('.')
  .map((x, i, a) => !(i % 2) && [x, a[i+1]])
  .filter(x => x)
  .sort((a, b) => a[1] - b[1])
  .flatMap(x => String.fromCharCode(+x[0]))
  .join('')